{"Discover a world of inspiration and connection":"Descubra un mundo de inspiración y conexión en LifeCom Radio. Como estación de radio cristiana comprometida con ofrecer contenido de calidad, lo invitamos a explorar nuestra diversa gama de transmisiones en vivo, programas a pedido y podcasts esclarecedores.","Discover a world of inspiration and connection at LifeCom Radio, where the power of music and spoken word converges to uplift your spirit and deepen your faith journey":{"":"Descubra un mundo de inspiración y conexión en LifeCom Radio, donde el poder de la música y la palabra hablada convergen para elevar su espíritu y profundizar su camino de fe."},"Download our mobile app and enjoy many more features":"Descarga nuestra aplicación móvil y disfruta de muchas más funciones","GLOBAL NEWS":"NOTICIAS GLOBALES","Learn More":"Aprende más","LISTEN ANYWHERE":"ESCUCHA EN CUALQUIER LUGAR","LISTENERS":"OYENTES","Listen to live radio shows and podcasts from your favorite hosts":"Escuche programas de radio en vivo y podcasts de sus presentadores favoritos","Our blog/news section serves as a hub for insightful articles, uplifting stories, and timely updates that enrich your faith journey and deepen your connection with our station":{"":"Nuestra sección de blog/noticias sirve como un centro para artículos interesantes, historias edificantes y actualizaciones oportunas que enriquecen su viaje de fe y profundizan su conexión con nuestra estación."},"Sound and Spirit":"Sonido y espíritu","SPIRITUAL RADIO":"RADIO ESPIRITUAL","Start Listening":"Empieza a escuchar","Stay Informed on the latest happenings globally":"Manténgase informado sobre los últimos acontecimientos a nivel mundial","Transforming Lives Through":"Transformando vidas a través de","You can get our mobile app on the Google and Apple app stores, or scan the code present on the screen":{"":"Puede obtener nuestra aplicación móvil en las tiendas de aplicaciones de Google y Apple, o escanear el código presente en la pantalla."}}