{"Discover a world of inspiration and connection":"Découvrez un monde d'inspiration et de connexion sur LifeCom Radio. En tant que station de radio chrétienne engagée à fournir un contenu de qualité, nous vous invitons à explorer notre gamme diversifiée d'émissions en direct, d'émissions à la demande et de podcasts éclairants.","Discover a world of inspiration and connection at LifeCom Radio, where the power of music and spoken word converges to uplift your spirit and deepen your faith journey":{"":"Découvrez un monde d'inspiration et de connexion sur LifeCom Radio, où le pouvoir de la musique et de la parole converge pour élever votre esprit et approfondir votre chemin de foi."},"Download our mobile app and enjoy many more features":"Téléchargez notre application mobile et profitez de nombreuses autres fonctionnalités","GLOBAL NEWS":"NOUVELLES MONDIALES","Learn More":"Apprendre encore plus","LISTEN ANYWHERE":"ÉCOUTEZ PARTOUT","LISTENERS":"LES AUDITEURS","Listen to live radio shows and podcasts from your favorite hosts":"Écoutez des émissions de radio en direct et des podcasts de vos animateurs préférés","Our blog/news section serves as a hub for insightful articles, uplifting stories, and timely updates that enrich your faith journey and deepen your connection with our station":{"":"Notre section blog/actualités sert de plaque tournante pour des articles perspicaces, des histoires édifiantes et des mises à jour opportunes qui enrichissent votre cheminement de foi et approfondissent votre lien avec notre station."},"Sound and Spirit":"Son et esprit","SPIRITUAL RADIO":"RADIO SPIRITUELLE","Start Listening":"Commence à écouter","Stay Informed on the latest happenings globally":"Restez informé des derniers événements dans le monde","Transforming Lives Through":"Transformer des vies grâce","You can get our mobile app on the Google and Apple app stores, or scan the code present on the screen":{"":"Vous pouvez télécharger notre application mobile sur les app stores de Google et Apple, ou scanner le code présent à l'écran."}}